const homeworkData = {
  "third-month-lesson-1-homework": {
    id: "third-month-lesson-1-homework",

    title: "واجب المحاضرة الأولى",

    courseId: "third-month-course",

    lessonId: "lesson-1",

    grade: "الثالث الثانوي",

    questions: [
      {
        id: "q1",
        question:
          "( يقدم المخلصون لوطنهم الكثير وبخاصة الشهداء ) . أعرب كلمة (الشهداء):",
        options: [
          "مضاف إليه.",
          "مبتدأ",
          "خبر.",
          "مفعول به",
        ],
        correctAnswer: 1,
      },

      {
        id: "q2",
        question:
          "( للكتاب منافعه العظيمة ) . حدد نوع الخبر في الجملة السابقة.",
        options: [
          "مفرد.",
          "جملة اسمية.",
          "جملة فعلية",
          "شبه جملة.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q3",
        question:
          "قال الشاعر: ( البحر تعلو فوقه جيف الفلا * والدر مطمور بأسفل رمله ). عند تحويل الخبر (تعلو ...) إلى مفرد يكون:",
        options: [
          "عال",
          "عالي.",
          "عاليا",
          "عالية.",
        ],
        correctAnswer: 0,
      },

      {
        id: "q4",
        question:
          "قال الشاعر: (الشجاع الشجاع عندي من * أمسى يغني والدمع في الأجفان). أي من التعبيرات الآتية لم يقع خبراً في البيت السابق؟",
        options: [
          "عندي.",
          "من أمسى.",
          "يغني",
          "في الأجفان.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q5",
        question:
          "قال الشاعر: ( ولكل آثام الدُّنَى مغفورة * إلا الخيانة ذنبها لا يغفر ). ميز نوع اللام الواردة في صدر البيت السابق.",
        options: [
          "القسم",
          "الابتداء",
          "الجر",
          "التعليل",
        ],
        correctAnswer: 1,
      },

      {
        id: "q6",
        question:
          "( ثمة تحديات ليست بالهيئة في طريق نهضتنا الشاملة ). حدد خبر المبتدأ في الجملة السابقة.",
        options: [
          "تحديات.",
          "ليست بالهيئة",
          "ثمة",
          "في طريق نهضتنا.",
        ],
        correctAnswer: 2,
      },

      {
        id: "q7",
        question:
          "( سألت الطالب: كيف حالك؟ قال: بخير ). حدد المحذوف، وحكم حذفه في الجملة السابقة.",
        options: [
          "المبتدأ - جائز.",
          "المبتدأ - واجب.",
          "الخبر - جائز.",
          "الخبر - واجب.",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q8",
        question:
          "قال الشاعر: ( قال لي: كيف أنت؟ قلت: عليل * سهر دائم وحزن طويل ). حدد إعراب كلمة (عليل) في سياقها:",
        options: [
          "مبتدأ مرفوع.",
          "خبر",
          "مفعول به",
          "نائب فاعل",
        ],
        correctAnswer: 1,
      },

      {
        id: "q9",
        question:
          "( ثم جهد مبذول لنهضة الوطن ). ما الإعراب الصحيح لكلمة (جهد)؟",
        options: [
          "مضاف إليه مجرور.",
          "معطوف منصوب.",
          "خبر مرفوع.",
          "مبتدأ مرفوع.",
        ],
        correctAnswer: 3,
      },

      {
        id: "q10",
        question:
          "( العامل في المصنع كل يوم يعمل بإخلاص ). حدد الخبر ونوعه في الجملة السابقة.",
        options: [
          "في المصنع - شبه جملة.",
          "كل يوم - مفرد.",
          "يعمل - جملة فعلية.",
          "كل يوم يعمل - جملة اسمية.",
        ],
        correctAnswer: 2,
      },

      {
        id: "q11",
        question:
          "( الطالب الحريص على هدفه من يبذل قصارى جهده ). حدد الخبر ونوعه.",
        options: [
          "الحريص - مفرد.",
          "على هدفه - شبه جملة.",
          "من - مفرد.",
          "يبذل - جملة.",
        ],
        correctAnswer: 2,
      },

      {
        id: "q12",
        question:
          "( الطريق الصحيح الطريق الذي يأخذك إلى معية الله ). أعرب كلمة (الطريق) بالترتيب.",
        options: [
          "مبتدأ - خبر",
          "مبتدأ - توكيد لفظي.",
          "مبتدأ - بدل",
          "خبر مقدم - مبتدأ مؤخر",
        ],
        correctAnswer: 0,
      },

      {
        id: "q13",
        question:
          "أي الجمل الآتية تشتمل على خبر مقدم وجوباً؟",
        options: [
          "عند جهينة الخبر اليقين.",
          "في أنفسنا معجزات.",
          "في الكتاب الفوائد.",
          "لله الفضل العظيم.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q14",
        question:
          "أي الجمل الآتية تشتمل على خبر مقدم جوازاً؟",
        options: [
          "متى اللقاء؟",
          "في القصيدة فصاحة وبيان.",
          "للعلماء مكانتهم.",
          "في السادسة مساء اللقاء.",
        ],
        correctAnswer: 3,
      },

      {
        id: "q15",
        question:
          "( النميمة أن تسعى بين اثنين بالفساد ). حدد الخبر ونوعه فيما سبق:",
        options: [
          "النميمة - خبر مفرد مقدم",
          "أن تسعى - خبر مفرد.",
          "أن تسعى - خبر جملة.",
          "بالفساد - خبر شبه جملة.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q16",
        question:
          "قال تعالى: « وَلَدَارُ الْآخِرَةِ خَيْرٌ لِّلَّذِينَ اتَّقَوْا أَفَلَا تَعْقِلُونَ ». حدد الخبر ونوعه فيما سبق.",
        options: [
          "لدار - شبه جملة.",
          "الآخرة - شبه جملة",
          "للذين - جملة",
          "خير - مفرد.",
        ],
        correctAnswer: 3,
      },

      {
        id: "q17",
        question:
          "قال تعالى: ( لَلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ ) [يونس: 26]. أعرب كلمة (الحسنى).",
        options: [
          "مبتدأ مؤخر وجوباً.",
          "مبتدأ مؤخر جوازاً.",
          "مفعول مطلق منصوب.",
          "مفعول به منصوب.",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q18",
        question:
          "ميز الجملة التي اشتملت على مبتدأ محذوف جوازاً.",
        options: [
          "لولا القراءة ما وصل العلم إلى ما وصل إليه.",
          "لعمري إن العلم النور.",
          "قرأت رواية لنجيب محفوظ، رواية عظيمة.",
          "في ذمتي لأكرمن الجيران.",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q19",
        question:
          "ميز الجملة التي اشتملت على مبتدأ محذوف جوازاً.",
        options: [
          "نعم ما يتصف به المؤمن حسن الخلق.",
          "يمين الله لأتمسكن بديني أينما حللت.",
          "لولا تقدم التكنولوجيا لاختلفت حياتنا كثيراً.",
          "الفلاح ومزرعته.",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q20",
        question:
          "حدد الجملة المشتملة على مبتدأ تعدد خبره:",
        options: [
          "أحمد شوقي أديب، شاعر مبدع.",
          "الراحة في قربك من الله.",
          "الحكمة أن تقول قليلاً، وتسمع كثيراً.",
          "التكنولوجيا فوائدها متعددة.",
        ],
        correctAnswer: 0,
      },

      {
        id: "q21",
        question:
          "( لله الحمد في الأولى والآخرة ). حدد سبب تقدم الخبر وحكم التقديم:",
        options: [
          "المبتدأ به ضمير يعود على الخبر - واجب.",
          "الخبر شبه جملة والمبتدأ معرفة - جائز.",
          "الخبر من الأسماء التي لها الصدارة - واجب.",
          "الخبر شبه جملة والمبتدأ نكرة - واجب.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q22",
        question:
          "( لكل عصر تحدياته التي تفرضها ظروف الحياة ). حدد سبب تقدم الخبر وحكم التقديم.",
        options: [
          "الخبر شبه جملة والمبتدأ معرفة - جائز.",
          "المبتدأ به ضمير يعود على الخبر - واجب.",
          "الخبر من الأسماء التي لها الصدارة - واجب.",
          "الخبر شبه جملة والمبتدأ نكرة - واجب.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q23",
        question:
          "قال الشاعر: ( فاعمل بما علمت فالعلماء إن * لم يعملوا شجر بلا أثمار ). حدد خبر المبتدأ (العلماء) ونوعه:",
        options: [
          "إن لم يعملوا - جملة فعلية",
          "شجر بلا إثمار - جملة اسمية.",
          "محذوف - مفرد",
          "شجر - مفرد.",
        ],
        correctAnswer: 3,
      },

      {
        id: "q24",
        question:
          "قال الشاعر: أين القصور الشامخات وأهلها * باد الجميع فهل ترى من باقية. أعرب كلا من (أين - القصور) بالترتيب.",
        options: [
          "مبتدأ - خبر.",
          "خبر مقدم - مبتدأ مؤخر.",
          "مبتدأ - مضاف إليه.",
          "خبر مقدم - مضاف إليه.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q25",
        question:
          "قال الشاعر: ( ألفاظه العذب الزلال أو أرق * ومعانيه السحر الحلال أو أدق ). وقعت كلمة (ألفاظه) مبتدأ، حدد خبره ونوعه:",
        options: [
          "الهاء في (ألفاظه) - مفرد.",
          "العذب - مفرد.",
          "(معانيه السحر...) - جملة.",
          "أرق - جملة.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q26",
        question:
          "( إلا تقبل على الله في كل حياتك فضيق صدر وضيق حياة ). ورد في الجملة خبر حذف مبتدؤه، فما حكم حذفه؟ وما تقديره؟",
        options: [
          "جائز تقديره (حالك).",
          "جائز تقديره (موجود).",
          "واجب تقديره (متلازمان).",
          "جائز تقديره (قسمي).",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q27",
        question:
          "قال الشاعر: ( جواد إذا استغنيت عن أخذ ماله * وعند احتمال الفقر عنك بخيل ). ما حكم حذف المبتدأ وما سبب الحذف في قوله (جواد)؟",
        options: [
          "واجب لأنه نكرة.",
          "جائز لأنه مفهوم من الكلام.",
          "واجب لأنه أسلوب ذم.",
          "جائز لأنه أسلوب ذم.",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q28",
        question:
          "قال الشاعر: ( كل وقت يمجد العلم فيه * هو لا ريب أسمح الأوقات ). اشتمل البيت على عدة أخبار، هي بالترتيب:",
        options: [
          "جملة - محذوف - مفرد.",
          "جملة - مفرد - محذوف.",
          "مفرد - محذوف - جملة.",
          "مفرد - جملة - محذوف.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q29",
        question:
          "قال تعالى: « هُذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ ... ». حدد الإعراب الصحيح لكلمة (هذان):",
        options: [
          "مبني في محل رفع مبتدأ.",
          "مرفوع بعلامة فرعية.",
          "مرفوع بعلامة أصلية.",
          "مرفوع بعلامة مقدرة.",
        ],
        correctAnswer: 0,
      },

      {
        id: "q30",
        question:
          "قال تعالى: « وَأُولُو الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ ». حدد الإعراب الصحيح لكلمة (أولو):",
        options: [
          "مبنية في محل رفع مبتدأ.",
          "مرفوعة بعلامة فرعية.",
          "مرفوعة بعلامة أصلية.",
          "مرفوعة بعلامة مقدرة.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q31",
        question:
          "( البر حسن الخلق، والإثم ما حاك في صدرك وكرهت أن يطلع عليه الناس ). حدد الخبر ونوعه فيما سبق:",
        options: [
          "البر - مفرد",
          "حسن - مفرد.",
          "الخلق - جملة",
          "الإثم - شبه جملة.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q32",
        question:
          "قال الشاعر: ( وكل أخ عند الهويني ملاطف * ولكنما الإخوان عند الشدائد ). حدد الخبر ونوعه فيما سبق:",
        options: [
          "ملاطف - مفرد.",
          "عند الهويني ملاطف - جملة اسمية.",
          "لكنما الإخوان - جملة فعلية.",
          "الإخوان - مفرد.",
        ],
        correctAnswer: 0,
      },

      {
        id: "q33",
        question:
          "قال الشاعر: ( أمشي إلى جانبها أزاحمها * عمداً وما بالطريق من ضيق ). حدد إعراب كلمة (ضيق) في سياقها.",
        options: [
          "اسم مجرور بالكسرة المقدرة.",
          "اسم مجرور بالفتحة الظاهرة.",
          "مبتدأ مجرور بكسرة ظاهرة.",
          "مبتدأ مرفوع لفظاً مجرور محلاً.",
        ],
        cancelled: true,
        correctAnswer: null,
      },

      {
        id: "q34",
        question:
          "( أقدّر الرجال، وبخاصة ذا الخلق الكريم ). حدد الصياغة الصحيحة للجملة بعد تصويب خطئها:",
        options: [
          "أقدر الرجال وبخاصة ذي الخلق الكريم.",
          "أقدر الرجال وبخاصة ذو الخلق الكريم.",
          "أقدر الرجال وبخاصة ذوى الخلق الكريم.",
          "أقدر الرجال وبخاصة ذوا الخلق الكريم.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q35",
        question:
          "( الوطن عظيم الشأن، رفيع المنزلة، فضله لا يُنكر ). ميز نوع الأخبار المتعددة في الجملة السابقة بالترتيب:",
        options: [
          "مفرد - جملة فعلية - جملة اسمية.",
          "جملة اسمية - مفرد - جملة فعلية.",
          "مفرد - جملة فعلية - مفرد.",
          "مفرد - مفرد - جملة اسمية.",
        ],
        correctAnswer: 3,
      },

      {
        id: "q36",
        question:
          "( للغة العربية أقدس لغة على وجه الأرض ). حدد المبتدأ والخبر في الجملة السابقة.",
        options: [
          "للغة خبر شبه جملة - أقدس مبتدأ مؤخر.",
          "للغة مبتدأ - أقدس خبر.",
          "للغة خبر مقدم - لغة مبتدأ مؤخر.",
          "للغة مبتدأ - على وجه الأرض خبر.",
        ],
        correctAnswer: 1,
      },

      {
        id: "q37",
        question:
          "قال رسول الله ﷺ: « الدين المعاملة ». حدد فيما سبق المبتدأ وخبره:",
        options: [
          "المبتدأ (الدين) والخبر محذوف جوازاً.",
          "المبتدأ محذوف، والخبر (الدين).",
          "المبتدأ (الدين)، والخبر (المعاملة).",
          "(الدين) خبر مقدم، والمبتدأ محذوف.",
        ],
        correctAnswer: 2,
      },
    ],
  },

  "third-month-lesson-2-homework": {
    id: "third-month-lesson-2-homework",

    title: "واجب المحاضرة الثانية",

    courseId: "third-month-course",

    lessonId: "lesson-2",

    grade: "الثالث الثانوي",

    videoId: "6pv2Rb6UPr4",

    questions: [
      {
        id: "q1",
        question: "السؤال 1",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 3,
      },
      {
        id: "q2",
        question: "السؤال 2",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q3",
        question: "السؤال 3",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 0,
      },
      {
        id: "q4",
        question: "السؤال 4",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 3,
      },
      {
        id: "q5",
        question: "السؤال 5",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q6",
        question: "السؤال 6",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 2,
      },
      {
        id: "q7",
        question: "السؤال 7",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q8",
        question: "السؤال 8",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q9",
        question: "السؤال 9",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q10",
        question: "السؤال 10",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q11",
        question: "السؤال 11",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 2,
      },
      {
        id: "q12",
        question: "السؤال 12",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 0,
      },
      {
        id: "q13",
        question: "السؤال 13",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q14",
        question: "السؤال 14",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 0,
      },
      {
        id: "q15",
        question: "السؤال 15",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 3,
      },
      {
        id: "q16",
        question: "السؤال 16",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 0,
      },
      {
        id: "q17",
        question: "السؤال 17",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
      {
        id: "q18",
        question: "السؤال 18",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 2,
      },
      {
        id: "q19",
        question: "السؤال 19",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 0,
      },
      {
        id: "q20",
        question: "السؤال 20",
        options: ["أ", "ب", "ج", "د"],
        correctAnswer: 1,
      },
    ],
  },
  "second-center-homework-1": {
    id: "second-center-homework-1",

    title: "واجب المحاضرة الأولي",

    grade: "الثاني الثانوي",

    studentType: "center",

    centerOnly: true,

    videoId: "LosP4RjBCfM",

    questions: [
      {
        id: "second-center-homework-1-q11",
        number: "11",
        type: "essay",
        question:
          "«إن القدرة العلمية لا تعني بالضرورة أن يكون كل شيء مباحًا أخلاقيا». حدد نوع الأسلوب: (خبري - إنشائي).",
        acceptedAnswers: [
          "خبري",
          "اسلوب خبري",
          "أسلوب خبري",
        ],
      },

      {
        id: "second-center-homework-1-q12",
        number: "12",
        type: "essay",
        question:
          "«هل كل ما يستطيع العلم فعله ينبغي أن يفعل؟». حدد نوع الأسلوب: (خبري - إنشائي).",
        acceptedAnswers: [
          "إنشائي",
          "انشائي",
          "اسلوب انشائي",
          "أسلوب إنشائي",
        ],
      },

      {
        id: "second-center-homework-1-q13",
        number: "13",
        type: "choice",
        question:
          "قال عنترة: «ولقد أبيت على الطوى وأظلهُ حتى أنال به كريم المأكل». ميز وسيلة التوكيد.",
        options: [
          "لام الابتداء.",
          "لقد.",
          "الترادف.",
          "حرف الجر الزائد.",
        ],
        correctAnswer: 1,
      },

      {
        id: "second-center-homework-1-q14",
        number: "14",
        type: "essay",
        question:
          "قال ربيعة بن مقروم: «أخوك أخوك من يدنو وترجو مودته وإن دعي استجابا». ميز وسيلة التوكيد.",
        acceptedAnswers: [
          "توكيد لفظي",
          "التوكيد اللفظي",
          "اسلوب مؤكد بالتوكيد اللفظي",
          "أسلوب مؤكد بالتوكيد اللفظي",
        ],
      },

      {
        id: "second-center-homework-1-q15",
        number: "15",
        type: "choice",
        question:
          "قال إبراهيم بن المهدي: «وإني وإن قدمت قبلي لعالم بأني وإن أبطأت منك قريب». ميز وسيلة التوكيد.",
        options: [
          "الترادف.",
          "إن.",
          "إن واللام.",
          "التوكيد اللفظي.",
        ],
        correctAnswer: 1,
      },

      {
        id: "second-center-homework-1-q16",
        number: "16",
        type: "essay",
        question:
          "قال علي بن الجهم: «لا تَعْجَبَنَّ لِصَرْفِ الدَّهْرِ كَيْفَ أَتَى فَكُلُّهُ عَجَبٌ يَأْوِي إِلَى عَجَبِ». ميز وسيلة التوكيد.",
        acceptedAnswers: [
          "نون التوكيد",
          "نون التوكيد الثقيلة",
          "اسلوب مؤكد بنون التوكيد",
          "أسلوب مؤكد بنون التوكيد",
        ],
      },

      {
        id: "second-center-homework-1-q50",
        number: "50",
        type: "essay",
        question:
          "«الخُلُقُ هو شُعور المرء بأنه مسئول أمام ضميره». حدد نوع الأسلوب: (خبري - إنشائي).",
        acceptedAnswers: [
          "خبري",
          "اسلوب خبري",
          "أسلوب خبري",
        ],
      },

      {
        id: "second-center-homework-1-q51",
        number: "51",
        type: "essay",
        question:
          "«فَلْيُحْيِ ضَمَائِرَهُم». حدد نوع الأسلوب.",
        acceptedAnswers: [
          "إنشائي أمر",
          "انشائي امر",
          "اسلوب انشائي طلبي امر",
          "أسلوب إنشائي طلبي أمر",
          "إنشائي طلبي أمر",
          "امر",
          "أمر",
        ],
      },

      {
        id: "second-center-homework-1-q52",
        number: "52",
        type: "essay",
        question:
          "«لا أُسمي الكريم كريمًا حتَّى تستوي عندَهُ صَدقَةُ السِّرِّ وَصَدَقَةُ العَلانِيَةِ». حدد نوع الأسلوب: (خبري - إنشائي).",
        acceptedAnswers: [
          "خبري",
          "اسلوب خبري",
          "أسلوب خبري",
        ],
      },

      {
        id: "second-center-homework-1-q53",
        number: "53",
        type: "essay",
        question:
          "قال شوقي: «ما جئتُ بِابَكَ مَادِحًا بَل دَاعِيًا ومن المديح تضرع وثناء». بين وسيلة التوكيد.",
        acceptedAnswers: [
          "القصر بحرف العطف بل",
          "القصر بالعطف بل",
          "القصر ببل",
          "حرف العطف بل",
        ],
      },

      {
        id: "second-center-homework-1-q54",
        number: "54",
        type: "essay",
        question:
          "قال حسان بن ثابت: «وَإِنِّي لَحُلُوْ تَعْتَرِينِي مَرَارَةٌ وَإِنِّي لَتَرَاكَ لِمَا لَمْ أَعُودِ». بين وسيلة التوكيد.",
        acceptedAnswers: [
          "إن واللام",
          "ان واللام",
          "بإن واللام",
          "بان واللام",
          "اسلوب مؤكد بإن واللام",
          "أسلوب مؤكد بإن واللام",
        ],
      },

      {
        id: "second-center-homework-1-q55",
        number: "55",
        type: "essay",
        question:
          "قال أبو ذؤيب الهذلي: «وَلَقَدْ حَرَصْتُ بِأَنْ أُدَافِعَ عَنْهُمُ فَإِذَا الْمَنِيَّةُ أَقْبَلَتْ لَا تُدْفَعُ». بين وسيلة التوكيد.",
        acceptedAnswers: [
          "لقد",
          "بلقد",
          "اسلوب مؤكد بلقد",
          "أسلوب مؤكد بلقد",
        ],
      },

      {
        id: "second-center-homework-1-q56",
        number: "56",
        type: "choice",
        question:
          "قال حسان بن ثابت: «لساني وسيفي صارمان كلاهما وَيَبْلُغُ ما لا يَبْلُغُ السَيفُ مِدْوَدِي». ميز وسيلة التوكيد.",
        options: [
          "التوكيد المعنوي.",
          "الترادف.",
          "التوكيد اللفظي.",
          "لام الابتداء.",
        ],
        correctAnswer: 0,
      },

      {
        id: "second-center-homework-1-q57",
        number: "57",
        type: "choice",
        question:
          "قال بشار بن برد: «وخَلَّ الهُوَيْنى للضعيف ولا تكن نئوما فإنَّ الحزم ليس بنائم». ميز وسيلة التوكيد.",
        options: [
          "القصر بالعطف.",
          "القصر بالتقديم والتأخير.",
          "إن وحرف الجر الزائد.",
          "إن واللام.",
        ],
        correctAnswer: 2,
      },

      {
        id: "second-center-homework-1-q58",
        number: "58",
        type: "choice",
        question:
          "قال الكاظمي: «لقد بان الخليط فَلا خليط وقد بَعدَ الحبيب فلا حبيب». ميز وسيلة التوكيد.",
        options: [
          "الترادف.",
          "التوكيد اللفظي.",
          "لقد.",
          "القصر بالعطف.",
        ],
        correctAnswer: 2,
      },

      {
        id: "second-center-homework-1-qA",
        number: "أ",
        type: "essay",
        question:
          "«كَفَى بِالْعِلْمِ فِي الظُّلُمَاتِ نُورًا». حدد نوع الأسلوب ووسيلة التوكيد.",
        acceptedAnswers: [
          "اسلوب مؤكد بحرف الجر الزائد",
          "أسلوب مؤكد بحرف الجر الزائد",
          "حرف الجر الزائد",
          "الباء الزائدة",
          "الباء حرف جر زائد",
        ],
      },

      {
        id: "second-center-homework-1-qB",
        number: "ب",
        type: "essay",
        question:
          "«فَلَا تَسْتَنْفِعُوا التَّعْلِيمَ إِلَّا...». حدد نوع الأسلوب.",
        acceptedAnswers: [
          "اسلوب انشائي طلبي نوعه نهي",
          "أسلوب إنشائي طلبي نوعه نهي",
          "إنشائي طلبي نهي",
          "انشائي طلبي نهي",
          "نهي",
        ],
      },

      {
        id: "second-center-homework-1-qC",
        number: "ج",
        type: "essay",
        question:
          "«فَإِنَّ عِمَادَ بَيْتِ الْمَجْدِ خُلُقٌ...». حدد وسيلة التوكيد.",
        acceptedAnswers: [
          "إن",
          "ان",
          "بإن",
          "بان",
          "اسلوب مؤكد بإن",
          "أسلوب مؤكد بإن",
        ],
      },

      {
        id: "second-center-homework-1-qOpinion",
        number: "س",
        type: "essay",
        question:
          "أي الجمل السابقة كان أقوى تأثيرًا في رأيك؟ ولماذا؟",
        acceptedAnswers: [
          "أ لانه استخدم حرف الجر الزائد وبين اهمية العلم",
          "أ لأنه استخدم حرف الجر الزائد وبين أهمية العلم",
          "الجملة أ لأنها استخدمت حرف الجر الزائد وبينت أهمية العلم",
          "الجملة أ لانها استخدمت حرف الجر الزائد وبينت اهمية العلم",
        ],
      },

      {
        id: "second-center-homework-1-q70",
        number: "70",
        type: "choice",
        question:
          "قال الشاعر: «هذا لعَمْرُكُمُ الصغار بعينه لا أُمَّ لي إن كان ذاك ولا أَبُ». حدد عدد وسائل التوكيد في الشطر الأول.",
        options: [
          "واحدة.",
          "اثنتان.",
          "ثلاث.",
          "أربع.",
        ],
        correctAnswer: 0,
      },

      {
        id: "second-center-homework-1-q70b",
        number: "70 - ب",
        type: "essay",
        question:
          "حدد وسيلة القصر في البيت السابق.",
        acceptedAnswers: [
          "الجار والمجرور",
          "جار ومجرور",
          "التقديم والتأخير",
          "تقديم الجار والمجرور",
        ],
      },

      {
        id: "second-center-homework-1-q71",
        number: "71",
        type: "choice",
        question:
          "قال أبو العتاهية: «لَعَمْرُكَ ما ينالُ الفَضْلَ إِلا تَقِيُّ القَلْبِ محتَسِبْ صَبور». من وسائل التوكيد في البيت السابق:",
        options: [
          "الترادف.",
          "القسم.",
          "التوكيد اللفظي.",
          "استخدام المضارع.",
        ],
        correctAnswer: 1,
      },

      {
        id: "second-center-homework-1-q71b",
        number: "71 - ب",
        type: "essay",
        question:
          "حدد وسيلة القصر في البيت السابق.",
        acceptedAnswers: [
          "النفي والاستثناء",
          "ما وإلا",
          "ما و إلا",
          "القصر بالنفي والاستثناء",
          "النفي ب ما والاستثناء ب إلا",
        ],
      },

      {
        id: "second-center-homework-1-q72",
        number: "72",
        type: "choice",
        question:
          "قال قطري بن الفجاءة: «فصبرًا في مجال الموتِ صَبْرًا فما نيل الخُلود بمستطاع». في البيت السابق وسائل التوكيد:",
        options: [
          "واحدة.",
          "اثنتان.",
          "ثلاث.",
          "أربع.",
        ],
        correctAnswer: 0,
      },

      {
        id: "second-center-homework-1-q72b",
        number: "72 - ب",
        type: "essay",
        question:
          "حدد علاقة الشطر الثاني بالأول من البيت السابق.",
        acceptedAnswers: [
          "تعليل",
          "التعليل",
          "علاقة تعليل",
        ],
      },

      {
        id: "second-center-homework-1-q73",
        number: "73",
        type: "choice",
        question:
          "حدد مما يلي البديل الذي لم يرد به أسلوب قصر.",
        options: [
          "قال تعالى: «إن حسابهم إلا على ربي لو تشعرون».",
          "قال تعالى: «إنما التوبة على الله للذين يعملون السوء بجهالة ثم يتوبون من قريب».",
          "قال الشاعر: «وما يعصم الكفار عنك حصونهم ولا شيء بعد الله غيرك يعصم».",
          "قال الشاعر: «فلما عرفت الدار قلت لربعها ألا انعم صباحا أيها الربع واسلم».",
        ],
        correctAnswer: 3,
      },

      {
        id: "second-center-homework-1-q74",
        number: "74",
        type: "choice",
        question:
          "يقول الشاعر: «أنا يا بني غدًا سيطويني الغسق / لم يبق من ظل الحياة سوى رمق / وحطام قلب عاش مشبوب القلق / قد أشرق المصباح يوما واحترق». حدد أسلوب القصر الوارد.",
        options: [
          "سيطويني الغسق.",
          "قد أشرق المصباح.",
          "عاش مشبوب القلق.",
          "لم يبق من ظل الحياة سوى رمق.",
        ],
        correctAnswer: 3,
      },
    ],
  },
};

export default homeworkData;